# Merging DataFrames

In [1]:
import pandas as pd
import numpy as np

In [2]:
staff_df = pd.DataFrame([{'name':'Kelly','role':'HR'},
                       {'name':'Sally','role':'PR'},
                       {'name':'John','role':'VC'}])
staff_df = staff_df.set_index('name')
staff_df

      role
name
Kelly   HR
Sally   PR
John    VC

In [3]:
stu_df = pd.DataFrame([{'name':'Mike','school':'business'},
                       {'name':'Sally','school':'marketing'},
                       {'name':'John','school':'management'}])
stu_df = stu_df.set_index('name')
stu_df

           school
name
Mike     business
Sally   marketing
John   management

In [4]:
pd.merge(staff_df, stu_df, how='outer', left_index=True, right_index=True)

      role      school
name
John    VC  management
Kelly   HR         NaN
Mike   NaN    business
Sally   PR   marketing

In [5]:
pd.merge(staff_df, stu_df, how='inner', left_index=True, right_index=True)

      role      school
name
Sally   PR   marketing
John    VC  management

In [6]:
pd.merge(staff_df, stu_df, how='left', left_index=True, right_index=True)

      role      school
name
Kelly   HR         NaN
Sally   PR   marketing
John    VC  management

In [7]:
staff_df.reset_index()

    name role
0  Kelly   HR
1  Sally   PR
2   John   VC

In [8]:
pd.merge(staff_df.reset_index(), stu_df.reset_index(), how='right', on='name')

    name role      school
0  Sally   PR   marketing
1   John   VC  management
2   Mike  NaN    business

In [9]:
len(stu_df)

3

In [10]:
stu_df.size

3

In [11]:
pd.concat([stu_df, staff_df])

      role      school
name
Mike   NaN    business
Sally  NaN   marketing
John   NaN  management
Kelly   HR         NaN
Sally   PR         NaN
John    VC         NaN

In [12]:
pd.concat([stu_df, staff_df],keys=['stud','staff'])

            role      school
      name
stud  Mike   NaN    business
      Sally  NaN   marketing
      John   NaN  management
staff Kelly   HR         NaN
      Sally   PR         NaN
      John    VC         NaN

# Pandas idioms

In [13]:
df = stu_df
df

           school
name
Mike     business
Sally   marketing
John   management

In [14]:
df.dropna() \
    .reset_index() \
    .set_index('school') \
    .rename(columns={'name': 'NAME'})

             NAME
school
business     Mike
marketing   Sally
management   John

In [15]:
(df.dropna()
    .reset_index()
    .set_index('school')
    .rename(columns={'name': 'NAME'}))

             NAME
school
business     Mike
marketing   Sally
management   John

In [16]:
df.reset_index().apply(lambda x: x*2, axis='columns')

         name                school
0    MikeMike      businessbusiness
1  SallySally    marketingmarketing
2    JohnJohn  managementmanagement

In [17]:
df = df.reset_index()
df

    name      school
0   Mike    business
1  Sally   marketing
2   John  management

In [18]:
df.apply(lambda x: np.min(x[['name','school']]), axis=1)

0     Mike
1    Sally
2     John
dtype: object

In [21]:
df = pd.DataFrame([{'name':'Mike','school':'business','score':5},
                   {'name':'Sally','school':'marketing','score':3},
                   {'name':'Mike','school':'business','score':4},
                   {'name':'Mike','school':'business','score':3},
                   {'name':'Sally','school':'marketing','score':4},
                   {'name':'John','school':'management','score':5}])
df

    name      school  score
0   Mike    business      5
1  Sally   marketing      3
2   Mike    business      4
3   Mike    business      3
4  Sally   marketing      4
5   John  management      5

In [25]:
for group, frame in df.groupby('name'):
    avg = np.mean(frame['score'])
    print(f'group: {group};\nframe: {frame};\navg: {avg}')

group: John;
frame:    name      school  score
5  John  management      5;
avg: 5.0
group: Mike;
frame:    name    school  score
0  Mike  business      5
2  Mike  business      4
3  Mike  business      3;
avg: 4.0
group: Sally;
frame:     name     school  score
1  Sally  marketing      3
4  Sally  marketing      4;
avg: 3.5

In [31]:
df

    name      school  score
0   Mike    business      5
1  Sally   marketing      3
2   Mike    business      4
3   Mike    business      3
4  Sally   marketing      4
5   John  management      5

In [30]:
np.mean(df['score'])

4.0

# Datetime

In [42]:
pd.Timestamp('9/1/2020 10.22AM')

Timestamp('2020-09-01 10:00:00')

In [43]:
pd.Timestamp(2021,12,6,0,0)

Timestamp('2021-12-06 00:00:00')

In [44]:
pd.Timestamp(2021,7,17,0,0).isoweekday()

6

In [45]:
pd.Timestamp(2021,7,17,0,0).week

28

In [47]:
pd.Timestamp(2021,7,17,0,0).weekday()

5

In [48]:
pd.Period('1/2016')

Period('2016-01', 'M')

In [49]:
pd.Period('3/5/2020')

Period('2020-03-05', 'D')

In [50]:
pd.Period('3/5/2020') + 30

Period('2020-04-04', 'D')

In [51]:
t1 = pd.Series(list('abc'), [pd.Timestamp('2020-09-09'),pd.Timestamp('2020-09-10'),pd.Timestamp('2020-09-11')])
t1

2020-09-09    a
2020-09-10    b
2020-09-11    c
dtype: object

In [52]:
type(t1.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [58]:
d1 = ['2 June 2020', 'Aug 29, 2014', '2020-05-26', '8/12/2021']
d1

['2 June 2020', 'Aug 29, 2014', '2020-05-26', '8/12/2021']

In [59]:
ts3 = pd.DataFrame(np.random.randint(10,100,(4,2)),index=d1,
                  columns=list('ab'))
ts3

               a   b
2 June 2020   46  19
Aug 29, 2014  34  61
2020-05-26    70  87
8/12/2021     17  33

In [60]:
ts3.index = pd.to_datetime(ts3.index)
ts3

             a   b
2020-06-02  46  19
2014-08-29  34  61
2020-05-26  70  87
2021-08-12  17  33

In [61]:
pd.to_datetime('4.7.12',dayfirst=True)

Timestamp('2012-07-04 00:00:00')

In [63]:
pd.Timestamp('21/12/2021') - pd.Timestamp('21/12/2018')

Timedelta('1096 days 00:00:00')

In [65]:
pd.Timestamp('21/12/2018').weekday()

4

In [66]:
pd.Timestamp('21/12/2018') + pd.offsets.Week()

Timestamp('2018-12-28 00:00:00')

In [67]:
pd.Timestamp('21/12/2018') + pd.offsets.MonthEnd()

Timestamp('2018-12-31 00:00:00')

In [69]:
dates = pd.date_range('10-01-2021', periods=9, freq='2W-SUN')
dates

DatetimeIndex(['2021-10-03', '2021-10-17', '2021-10-31', '2021-11-14',
               '2021-11-28', '2021-12-12', '2021-12-26', '2022-01-09',
               '2022-01-23'],
              dtype='datetime64[ns]', freq='2W-SUN')

In [73]:
dates

DatetimeIndex(['2021-10-03', '2021-10-17', '2021-10-31', '2021-11-14',
               '2021-11-28', '2021-12-12', '2021-12-26', '2022-01-09',
               '2022-01-23'],
              dtype='datetime64[ns]', freq='2W-SUN')